Tekla.Structures.Model.UI.ModelObjectVisualization
The class to set and clear temporary visualization (color and transparency) for model objects in view.
Permanent representation will be restored when view is redrawn or temporary visualization is cleared.
Can be used also to fetch current permanent representation of model object.
using Tekla.Structures.Model;
using Tekla.Structures.Model.UI;
using Tekla.Structures.Geometry3d;
using System.Collections;
public class Example
{
public void Example1()
{
Model model = new Model();
Beam b = new Beam(new Point(0,0,0), new Point(0,0,6000));
Beam b1 = new Beam(new Point(0,1000,0), new Point(0,1000,6000));
Beam b2 = new Beam(new Point(0,2000,0), new Point(0,2000,6000));
b.Material.MaterialString = b1.Material.MaterialString = b2.Material.MaterialString = "Steel_Undefined";
b.Profile.ProfileString = b1.Profile.ProfileString = b2.Profile.ProfileString = "PL10*1000";
b.Insert();
b1.Insert();
b2.Insert();
model.CommitChanges();
var blueObjects = new List<ModelObject> { b , b2 };
var redObjects = new List<ModelObject> { b1 };
ModelObjectVisualization.SetTransparencyForAll(TemporaryTransparency.HIDDEN);
ModelObjectVisualization.SetTemporaryState(blueObjects, new TSM.UI.Color(0.0, 0.0, 1.0));
ModelObjectVisualization.SetTemporaryState(redObjects, new TSM.UI.Color(1.0, 0.0, 0.0));
}
public void Example2()
{
Model model = new Model();
Beam b = new Beam(new Point(0,0,0), new Point(0,0,6000));
b.Material.MaterialString =  "Steel_Undefined";
b.Profile.ProfileString = "PL10*1000";
b.Insert();
model.CommitChanges();
var blueObjects = new List<ModelObject> { b };
ModelObjectVisualization.SetVisibility(blueObjects, false); // Makes the beam invisible
ModelObjectVisualization.SetVisibility(blueObjects, true); // Makes the beam visible
ModelObjectVisualization.SetVisibility(blueObjects, null); // Reset to original state
ModelObjectVisualization.SetVisibility(null, true); // Sets all objects visible
}
}

Tekla.Structures.Model.UI.ModelObjectVisualization.SetVisibility(System.Collections.Generic.List{Tekla.Structures.Model.ModelObject},System.Nullable{System.Boolean})
Sets visibility for given model objects.
modelObjects: The list of model objects, null for all objects
Visible: Nullable boolean if to set to visible or reset state
Returns:

Tekla.Structures.Model.UI.ModelObjectVisualization.SetTemporaryStateForAll(Tekla.Structures.Model.UI.Color)
Sets temporary visualization state (red, blue, green and transparency) for all model objects
color: The temporary state for all model objects.
Returns: True if the temporary state could be set.

Tekla.Structures.Model.UI.ModelObjectVisualization.SetTemporaryState(System.Collections.Generic.List{Tekla.Structures.Model.ModelObject},Tekla.Structures.Model.UI.Color)
Sets visualization temporary state (red, blue, green and transparency) for given model objects
modelObjects: The list of model objects.
color: The temporary state for given model objects.
Returns: True if the temporary state could be set.

Tekla.Structures.Model.UI.ModelObjectVisualization.SetTransparencyForAll(Tekla.Structures.Model.UI.TemporaryTransparency)
Restores permanent representation settings and sets temporary transparency for all model objects
transparency: The temporary transparency for all model objects.
Returns: True if the temporary transparency could be set.

Tekla.Structures.Model.UI.ModelObjectVisualization.SetTransparency(System.Collections.Generic.List{Tekla.Structures.Model.ModelObject},Tekla.Structures.Model.UI.TemporaryTransparency)
Restores permanent representation settings and sets temporary transparency for given model objects
modelObjects: The list of model objects.
transparency: The temporary transparency for given objects.
Returns: True if the temporary transparency could be set.

Tekla.Structures.Model.UI.ModelObjectVisualization.SetTransparency(System.Collections.Generic.List{Tekla.Structures.Identifier},Tekla.Structures.Model.UI.TemporaryTransparency)
Restores permanent representation settings and sets temporary transparency for given model object identifiers
identifiers: The list of model object identifiers.
transparency: The temporary transparency for given objects.
Returns: True if the temporary transparency could be set.

Tekla.Structures.Model.UI.ModelObjectVisualization.SetTemporaryState(System.Collections.Generic.List{Tekla.Structures.Identifier},Tekla.Structures.Model.UI.Color)
Sets visualization temporary state (red, blue, green and transparency) for given model object identifiers
identifiers: The list of model object identifiers.
color: The temporary color for given model objects.
Returns: True if the temporary state could be set.

Tekla.Structures.Model.UI.ModelObjectVisualization.GetRepresentation(Tekla.Structures.Model.ModelObject,Tekla.Structures.Model.UI.Color@)
Gets current permanent representation (red, blue, green and transparency) of given model object
modelObject: The model object to check.
color: The color of given model object.
Returns: True if the permanent representation could be fetched.

Tekla.Structures.Model.UI.ModelObjectVisualization.GetTempRepresentation(Tekla.Structures.Model.ModelObject)
Gets the temporary representation (red, blue, green and transparency) of given model object
modelObject: The model object to check.
Returns: The temporary representation or null if not set.

Tekla.Structures.Model.UI.ModelObjectVisualization.GetAllTemporaryColored
Gets all temporary colored objects and their color
Returns: Enumerable of Identifier-Color pairs

Tekla.Structures.Model.UI.ModelObjectVisualization.ClearAllTemporaryStates
Clears temporary visualization from all model objects and restores permanent representation.
Returns: True if the permanent representation could be restored.

Tekla.Structures.Model.UI.ModelObjectVisualization.ClearTemporaryStates(System.Collections.Generic.List{Tekla.Structures.Model.ModelObject})
Clears temporary visualization from model objects and restores permanent representation.
Returns: True if the permanent representation could be restored.

Tekla.Structures.Model.UI.ModelObjectVisualization.UnhideParts
Unide all parts in the model.